# Rebar Set Hook Rotation Angle Method

Source: https://www.revitapidocs.com/2026/399efb81-f360-4e7b-bbc3-938325f0baba.htm

---

| Rebar Set Hook Rotation Angle Method |
| --- |

**Note: This API is now obsolete.**

Sets the terminitation's out of plane hook rotation angle at the specified end. The rotation angle it's the same for both hook and crank.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
[ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.SetTerminationRotationAngle instead.")]
public void SetHookRotationAngle(
	double rotationAngle,
	int end
)
```

```
<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.SetTerminationRotationAngle instead.")>
Public Sub SetHookRotationAngle (
	rotationAngle As Double,
	end As Integer
)
```

```
public:
[ObsoleteAttribute(L"This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.SetTerminationRotationAngle instead.")]
void SetHookRotationAngle(
	double rotationAngle,
	int end
)
```

```
[<ObsoleteAttribute("This method is deprecated in Revit 2026 and may be removed in a later version of Revit. Please use Rebar.SetTerminationRotationAngle instead.")>]
member SetHookRotationAngle :
        rotationAngle : float *
        end : int -> unit
```

#### Parameters

rotationAngle Double
:   The termination's out of plane rotation angle at the specified end. The rotation angle it's the same for both hook and crank.

end Int32
:   0 for the start, 1 for the end.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The given value for rotationAngle is not finite |
| ArgumentOutOfRangeException | end must be 0 or 1\. |

See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace